Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For more fine-grained control over security, consider overriding the onFilterTouchEventForSecurity(android.view.MotionEvent) method to implement your own security policy.
zh_cn: 要获得对安全性的更细粒度控制，请考虑重写 onFilterTouchEventForSecurity(android.view.MotionEvent) 方法以实现你自己的安全策略。

source: For more information about ProGuard and other ways Android Studio helps you reduce APK size, see Shrink Your Code and Resources.
zh_cn: 有关 ProGuard 以及 Android Studio 帮助你减少 APK 大小的其他方式的更多信息，请参阅 Shrink Your Code and Resources。

source: For more information about creating user interface layouts, read the XML Layouts developer guide.
zh_cn: 有关创建用户界面布局的更多信息，请阅读 XML Layouts 开发人员指南。

source: For more information about how to use DrawerLayout, read Creating a Navigation Drawer.
zh_cn: 有关如何使用 DrawerLayout 的更多信息，请阅读 Creating a Navigation Drawer。

source: For more information about how to use ViewPager, read Creating Swipe Views with Tabs.
zh_cn: 有关如何使用 ViewPager 的更多信息，请阅读 Creating Swipe Views with Tabs。

source: For more information about selecting the correct image format to improve download speed, see Reduce image download sizes.
zh_cn: 有关选择正确的图像格式以提高下载速度的详细信息，请参阅 Reduce image download sizes。

source: For more information about the Paging library, see the library documentation.
zh_cn: 有关分页库的更多信息，请参阅 library documentation。

source: For more information about the WebP image format, see the WebP site.
zh_cn: 有关 WebP 图像格式的详细信息，请参阅 WebP site。

source: For more information about this feature, see Remove unused alternative resources.
zh_cn: 有关此功能的详细信息，请参阅 Remove unused alternative resources。

source: For more information about using AdapterView, read the Binding to Data with AdapterView developer guide.
zh_cn: 有关使用 AdapterView 的更多信息，请阅读 Binding to Data with AdapterView 开发人员指南。

source: For more information about using resources, see the documentation about Application Resources.
zh_cn: 有关使用资源的更多信息，请参阅有关 Application Resources 的文档。

source: For more information on creating accessible views, see Making Applications Accessible in the Android Developers Guide.
zh_cn: 有关创建无障碍 view 的更多信息，请参阅 Android 开发者指南中的 Making Applications Accessible。

source: For more information on working with VectorDrawable objects, see Working with Drawables.
zh_cn: 有关使用 VectorDrawable 对象的更多信息，请参阅 Working with Drawables。

source: For more information screen densities, see Screen Sizes and Densities.
zh_cn: 有关屏幕密度的更多信息，请参阅 Screen Sizes and Densities。

source: For more information, see Configure APK Splits and Maintaining Multiple APKs.
zh_cn: 有关详细信息，请参阅 Configure APK Splits 和 Maintaining Multiple APKs。

source: For more information, see Create WebP Images Using Android Studio.
zh_cn: 有关更多信息，请参阅 Create WebP Images Using Android Studio。

source: For proper rendering of the ancestor TextView in RTL mode, call setLayoutDirection(int) with View.LAYOUT_DIRECTION_LOCALE.
zh_cn: 要在 RTL 模式下正确呈现祖先 TextView，请使用 View.LAYOUT_DIRECTION_LOCALE 调用 setLayoutDirection(int)。

source: For screenshots of the UI for feedback reports or unit testing the PixelCopy API is recommended.
zh_cn: 对于用于反馈报告或单元测试的 UI 的屏幕截图，建议使用 PixelCopy API。

source: For situations where the application would like to simply stay full screen the entire time (such as a game that wants to take over the screen), the window flag is usually a better approach.
zh_cn: 对于应用程序希望在整个时间内完全保持全屏的情况(例如想要接管屏幕的游戏)，window flag 通常是更好做法。

source: For software-rendered snapshots of a small part of the View hierarchy or individual Views it is recommended to create a Canvas from either a Bitmap or Picture and call draw(android.graphics.Canvas) on the View.
zh_cn: 对于 view 层次结构或单个 view 的一小部分的软件渲染快照，建议从 Bitmap 或 Picture 创建 Canvas 并在 view 上调用 draw(android.graphics.Canvas)。

source: For the NotePad sample, overriding the onDraw() method allows us to paint the blue lines on the EditText view canvas (the canvas is passed into the overridden onDraw() method).
zh_cn: 对于 NotePad 示例，重写 onDraw() 方法允许我们在 EditText 的画布上绘制蓝线（画布是通过 onDraw() 方法传递的）。

source: For the re-decode to happen, the bitmap must have access to the encoded data, either by sharing a reference to the input or by making a copy of it.
zh_cn: 为了进行重新解码，位图必须能够访问编码数据，或者通过共享对输入的引用或复制它。

source: For the velocity value, you can use the value computed for you by GestureDetector.
zh_cn: 对于速度值，你可以使用 GestureDetector 为你计算的值。

source: For this reason, RecyclerView leaves the decision to the Adapter and uses the return value of this method to decide whether the View should be recycled or not.
zh_cn: 因此，RecyclerView 将决定权留给适配器，并使用此方法的返回值来决定是否应回收 View。

source: For this reason, there are two types of position related methods in RecyclerView:
zh_cn: 因为这个原因，在 RecyclerView 中有 2 种类型的与 position 相关方法。

source: For this reason, you can specify an alternate margin value to be used when the connection is to a widget being marked as gone (see the section above about the gone margin attributes).
zh_cn: 因此，你可以指定一个当连接到的小部件被标记为 GONE 时所使用的备用 margni 值(参见 the section above about the gone margin attributes)。

source: For this reason, you should only use the position parameter while acquiring the related data item inside this method and should not keep a copy of it.
zh_cn: 因此，在获取此方法中的相关数据项时，只应使用 position 参数，而不应保留其副本。

source: For this reasons, you should carefully handle NO_POSITION or null results from these methods.
zh_cn: 为此原因，你要小心处理这些方法返回的 NO_POSITION 或 null 的结果。

source: For this sample, overriding the onDraw() method allows us to paint the blue lines on the EditText view canvas (the canvas is passed into the overridden onDraw() method).
zh_cn: 对于此示例，重写 onDraw() 方法允许我们在 EditText 视图画布上绘制蓝线（画布将传递到重写的 onDraw() 方法）。

source: For this to take effect, the window must be drawing the system bar backgrounds with WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS and WindowManager.LayoutParams.FLAG_TRANSLUCENT_STATUS must not be set.
zh_cn: 要使此操作生效，窗口必须使用 WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS 来绘制系统栏背景，并且不得设置 WindowManager.LayoutParams.FLAG_TRANSLUCENT_STATUS。

source: For this to take effect, the window must request FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS but not FLAG_TRANSLUCENT_STATUS.
zh_cn: 要使此操作生效，窗口必须请求 FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS，但不能请求 FLAG_TRANSLUCENT_STATUS。

source: For unfilled buttons, this class uses ?attr/colorPrimary for the text color and transparent for the background tint.
zh_cn: 对于未填充的按钮，此类使用 ?attr/colorPrimary 作为文本颜色，对背景色调使用透明。

source: For vertical scrolling, consider NestedScrollView instead of scroll view which offers greater user interface flexibility and support for the material design scrolling patterns.
zh_cn: 对于垂直滚动，请考虑 NestedScrollView 而不是 scroll view ，这提供了更大的用户界面灵活性并支持材质设计滚动模式。

source: For vertical scrolling, use either ScrollView or ListView.
zh_cn: 对于垂直滚动，请使用 ScrollView 或 ListView。

source: For views inside a scrolling container, delay the pressed feedback for a short period in case this is a scroll.
zh_cn: 对于滚动容器中的 view，如果这是一个滚动，将按下的反馈延迟一段时间。

source: Force the finished field to a particular value.
zh_cn: 强制 finished 字段为特定值。

source: Forgetting these method calls can cause hard-to-find bugs.
zh_cn: 忘记这些方法调用可能会导致难以发现的错误。

source: Format string: if specified, the Chronometer will display this string, with the first "%s" replaced by the current timer value in "MM:SS" or "H:MM:SS" form.
zh_cn: 格式字符串：如果指定，计时器将显示此字符串，第一个“%s”替换为“MM:SS”或“H:MM:SS”形式的当前计时器值。

source: Formats the string necessary for grammatically correct pluralization of the given resource ID for the given quantity, using the given arguments.
zh_cn: 使用给定参数，为给定数量的给定资源 ID 的语法正确复数设置所需的字符串格式。

source: Fortunately, Android provides helper classes to simulate this and other behaviors.
zh_cn: 幸运的是，Android 提供了帮助类来模拟这个和其他行为。

source: Fortunately, you can easily create components that look and behave in any way you like, limited perhaps only by your imagination, the size of the screen, and the available processing power (remember that ultimately your application might have to run on something with significantly less power than your desktop workstation).
zh_cn: 幸运的是，你可以很轻松的创建一个任意样式、任意行为的组件，只要你喜欢。所受的限制可能仅仅是你的想象力、屏幕的大小以及可用的处理能力(记住最终你的应用要运行在一个很多性能都比你的电脑要差的系统上)。

source: Fragments start out not hidden; this will be called whenever the fragment changes state from that.
zh_cn: Fragments 开始果不是隐藏的，当 fragment 的状态从那状态开始改变时，该方法将被调用。

source: FrameLayout is designed to block out an area on the screen to display a single item.
zh_cn: FrameLayout 旨在屏蔽屏幕上的一个区域以显示单个项目。

source: Frees up the memory associated with this region decoder, and mark the region decoder as "dead", meaning it will throw an exception if decodeRegion(), getWidth() or getHeight() is called.
zh_cn: 释放与该区域解码器相关联的存储器，并将区域解码器标记为 "dead"，这意味着如果调用 decodeRegion()，getWidth() 或 getHeight()，它将抛出异常。

source: From RecyclerView's perspective, the view is still recyclable since Adapter wants to do so.
zh_cn: 从 RecyclerView 的角度来看，view 仍然是可回收的，因为适配器希望这样做。

source: From XML, use this syntax: android:scaleType="center".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="center"。

source: From XML, use this syntax: android:scaleType="centerCrop".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="centerCrop"。

source: From XML, use this syntax: android:scaleType="centerInside".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="centerInside"。

source: From XML, use this syntax: android:scaleType="fitCenter".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="fitCenter"。

source: From XML, use this syntax: android:scaleType="fitEnd".
zh_cn: 在 XML 中， use this syntax: android:scaleType="fitEnd".

source: From XML, use this syntax: android:scaleType="fitStart".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="fitStart"。

source: From XML, use this syntax: android:scaleType="fitXY".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="fitXY"。

source: From XML, use this syntax: android:scaleType="matrix".
zh_cn: 在 XML 中，使用以下语法：android:scaleType="matrix"。

source: From interface java.lang.annotation.Annotation
zh_cn: 从接口 java.lang.annotation.Annotation

source: From start to end, a toolbar may contain a combination of the following optional elements:
zh_cn: 从开始到结束，工具栏可能包含以下可选元素的组合：

source: From the onCreate method of an Activity, find the Button
zh_cn: 在 Activity 的 onCreate 方法中，找出该按钮。

source: From there you can change the tab's label or icon via setText(int) and setIcon(int) respectively.
zh_cn: 从那里，你可以分别通过 setText(int) 和 setIcon(int) 更改选项卡的标签或图标。

source: From this point onward, only views for which isFocusableInTouchMode() is true will be focusable, such as text editing widgets.
zh_cn: 从这时起，只有 isFocusableInTouchMode() 是 true 的 view 才是可聚焦的，如文本输入控件。

source: From this point, system- and app-level processes proceed in accordance with the app lifecycle stages.
zh_cn: 从这一点开始，系统级和应用级进程按照 应用程序生命周期（app lifecycle stages） 执行。

source: From your activity, you can retrieve an instance of ActionBar by calling AppCompatActivity.getSupportActionBar() getSupportActionBar()}.
zh_cn: 从你的 activity 中，你可以通过调用 AppCompatActivity.getSupportActionBar() 来获取 ActionBar 的实例。

source: Fully Customized Components
zh_cn: 完整的自定义组件

source: Fully Qualify Imports
zh_cn: 完全合格的导入

source: Fully customized components can be used to create graphical components that appear however you wish.
zh_cn: 完整的自定义组件可以用来创建一个图形组件，它可以按你想的任意呈现。

source: Functions like show() and hide() have no effect when MediaController is created in an xml layout.
zh_cn: 在 xml 布局中创建 MediaController 时，show() 和 hide() 等函数无效。

source: Furthermore, this is not a default constructor, but a parameterized one.
zh_cn: 此外，这不是一个默认的，而是一个带着参数的构造方法。

source: GONE views are taken to have zero weight during excess space distribution.
zh_cn: 在过多的空间分布期间，GONE view 被认为具有零权重。

source: Gallery extends LayoutParams to provide a place to hold current Transformation information along with previous position/transformation info.
zh_cn: Gallery 扩展了 LayoutParams 以提供一个位置来保存当前转换信息以及先前的位置/转换信息。

source: Garbage collection is especially a consideration with the Dalvik runtime; the Art runtime performs garbage collection concurrently, minimizing that operation's impact.
zh_cn: 垃圾收集尤其是 Dalvik 运行时的考虑因素; Art 运行时同时执行垃圾收集，最大限度地减少操作的影响。

source: Generally this means that a touch scroll has ended with a velocity in the direction of scrolling that meets or exceeds the minimum fling velocity along a scrollable axis.
zh_cn: 通常这意味着触摸滚动在滚动方向上以 velocity 结束，沿可滚动轴达到或超过 minimum fling velocity。

source: Generally, FrameLayout should be used to hold a single child view, because it can be difficult to organize child views in a way that's scalable to different screen sizes without the children overlapping each other.
zh_cn: 通常，FrameLayout 应该用于保存单个子 view，因为很难以可扩展到不同屏幕大小而子项不会相互重叠的方式组织子 view。

source: Generally, this should be done for containers that can scroll, such as a List.
zh_cn: 通常，应该对可以滚动的容器(例如 List)执行此操作。

source: Generate a new Theme object for this set of Resources.
zh_cn: 为这组资源生成一个新的 Theme 对象。

source: Generating the Content URI for a File
zh_cn: 生成文件的 content URI

source: Gestures are a powerful way to control touchscreen devices, but they can be counterintuitive and difficult to remember unless they produce physically plausible results.
zh_cn: 手势是控制触摸屏设备的有效方式，但它们可能违反直觉并且难以记住，除非它们产生物理上可信的结果。

source: Get the Z-axis elevation of the action bar in pixels.
zh_cn: 获取操作栏的 Z 轴高程(以像素为单位)。

source: Get the behavior governing the layout and interaction of the child view within a parent CoordinatorLayout.
zh_cn: 获取管理父 viewCoordinatorLayout 中子 view 的布局和交互的行为。

source: Get the behavior-specific tag object with the given child view.
zh_cn: 使用给定的子 view 获取特定于行为的标记对象。

source: Get the id of this view's anchor.
zh_cn: 获取此 view 的锚点 ID。

source: Get the raw value associated with a resource with associated density.
zh_cn: 获取与具有关联密度的资源关联的原始值。

source: Gets the Object mapped from the specified key, or null if no such mapping has been made.
zh_cn: 获取从指定键映射的对象，如果未进行此类映射，则返回 null。

source: Gets the Object mapped from the specified key, or the specified Object if no such mapping has been made.
zh_cn: 获取从指定键映射的对象，如果尚未进行此类映射，则返回指定的对象。

source: Gets the content inset that will be used on the ending side of the bar in the current toolbar configuration.
zh_cn: 获取在当前工具栏配置中，栏的结尾侧使用的内容内缩。

source: Gets the content inset that will be used on the left side of the bar in the current toolbar configuration.
zh_cn: 获取在当前工具栏配置中，栏的左侧使用的内容内缩。

source: Gets the content inset that will be used on the right side of the bar in the current toolbar configuration.
zh_cn: 获取在当前工具栏配置中，栏右侧使用的内容内缩。

source: Gets the content inset that will be used on the starting side of the bar in the current toolbar configuration.
zh_cn: 获取在当前工具栏配置中，栏的起始侧使用的内容内缩。

source: Gets the current ItemAnimator for this RecyclerView.
zh_cn: 获取当前 RecyclerView 的 ItemAnimator。

source: Gets the drawable used to draw in the insets area for the status bar.
zh_cn: 获取用于在状态栏的 insets 区域中绘制的 drawable。

source: Gets the end content inset to use when action buttons are present.
zh_cn: 获取操作按钮存在时使用的结束侧内容内缩。

source: Gets the ending content inset for this toolbar.
zh_cn: 获取此工具栏的结束侧内容内缩。

source: Gets the left content inset for this toolbar.
zh_cn: 获取此工具栏的左侧内容内缩。

source: Gets the right content inset for this toolbar.
zh_cn: 获取此工具栏的右侧内容内缩。

source: Gets the start content inset to use when a navigation button is present.
zh_cn: 获取导航按钮存在时要使用的起始侧内容内缩。

source: Gets the starting content inset for this toolbar.
zh_cn: 获取此工具栏的起始侧内容内缩。

source: Give it the new pointer in addition to the ones it is handling.
zh_cn: 除了它正在处理的指针之外，还要给它一个新指针。

source: Given a BitmapRegionDecoder, users can call decodeRegion() repeatedly to get a decoded Bitmap of the specified region.
zh_cn: 给定 BitmapRegionDecoder，用户可以重复调用 decodeRegion() 以获得指定区域的解码位图。

source: Given an index in the range 0...size()-1, returns the key from the indexth key-value mapping that this SparseArray stores.
zh_cn: 给定一个在 0...size()-1 范围内的索引，从该 SparseArray 存储的第 index 个键值映射返回键。

source: Given an index in the range 0...size()-1, returns the value from the indexth key-value mapping that this SparseArray stores.
zh_cn: 给定一个在 0...size()-1 范围内的索引，从该 SparseArray 存储的第 index 个键值映射返回值。

source: Given an index in the range 0...size()-1, sets a new value for the indexth key-value mapping that this SparseArray stores.
zh_cn: 给定一个在 0...size()-1 范围内的索引，为 SparseArray 存储的第 index 个键值映射设置一个新值。

source: Glossary of terms:
zh_cn: 术语表：

source: Good
zh_cn: 良好

source: Gradle can automatically remove resources on your behalf if you enable shrinkResources in your app's build.gradle file.
zh_cn: 如果在应用程序的 build.gradle 文件中启用 shrinkResources，Gradle 可以为你自动移除资源。

source: Gradle passes this information to the build system using the resConfig and resConfigs flavors and the defaultConfig option.
zh_cn: Gradle 使用 resConfig 和 resConfigs flavor 以及 defaultConfig 选项将此信息传递给构建系统。

source: Granting Temporary Permissions to a URI
zh_cn: 授予 URI 临时权限

source: Gravity setting for positioning the currently selected item.
zh_cn: 用于定位当前所选项目的重力设置。

source: GridLayoutManager automatically calls this method when adapter changes occur.
zh_cn: 当 adapter 发生改变时，GridLayoutManager 自动调用该方法。 。

source: GridLayoutManager does not call this method for each item.
zh_cn: GridLayoutManager 不会为每一个 item 都调用些方法。

source: Group zero denotes the entire pattern by convention.
zh_cn: 根据惯例，零组表示整个模式。

source: Group zero denotes the entire pattern, so the expression m.end(0) is equivalent to m.end().
zh_cn: Group 0 表示整个 pattern，因此表达式 m.end(0) 等价于 m.end().

source: Group zero denotes the entire pattern, so the expression m.start(0) is equivalent to m.start().
zh_cn: 组零表示整个模式，因此表达式 m.start(0) 等效于 m.start().

source: Group zero denotes the entire pattern, so the expression m.group(0) is equivalent to m.group().
zh_cn: 组 0 表示整个模式，所以表达式 m.group(0) 等效于 m.group().

source: Grow the horizontal and vertical size of the object if needed so it completely fills its container.
zh_cn: 如果需要，增加对象的水平和垂直尺寸，以便完全填充其容器。

source: Grow the horizontal size of the object if needed so it completely fills its container.
zh_cn: 如果需要，增加对象的水平尺寸，以便完全填充其容器。

source: Grow the vertical size of the object if needed so it completely fills its container.
zh_cn: 如果需要，增大对象的垂直尺寸，使其完全填充其容器。

source: Handle Input Gestures
zh_cn: 处理输入手势

source: Handle Layout Events
zh_cn: 处理布局事件

source: Handle an initial down.
zh_cn: 处理初始 down。

source: Handle the error gracefully and substitute an appropriate value in the catch {} block.
zh_cn: 妥善处理错误，并替换 catch {} 块中的相应值。

source: Having a full filesystem on a filesystem that is accessible to or on behalf of third-party applications should not be logged at a level higher than INFORMATIVE.
zh_cn: 如果在第三方应用可访问或代表第三方应用的文件系统上拥有完整的文件系统，则不应该记录高于 INFORMATIVE 级别的日志。

source: Having all of your resource initialization on the main thread can also slow down startup.
zh_cn: 在主线程上进行所有资源初始化也会降低启动速度。

source: Heavy activity initialization
zh_cn: 繁重的 activity 初始化

source: Heavy app initialization
zh_cn: 繁重的应用初始化

source: Height of the divider.
zh_cn: 分隔线的高度。

source: Helper class for showing "bread crumbs" representing the fragment stack in an activity.
zh_cn: 助手类，用于显示表示 activity 中 fragment 堆栈的“面包屑导航”。

source: Helper objects are not displayed on device (they are marked as View.GONE) and are only used for layout purposes.
zh_cn: 辅助对象不会显示在设备上(它们被标记为 View.GONE )，仅用于布局。

source: Here are some things to note in this file:
zh_cn: 以下是此文件中需要注意的事项：

source: Here is a complete implementation of a custom ViewGroup that implements a simple FrameLayout along with the ability to stack children in left and right gutters.
zh_cn: 这是一个自定义 ViewGroup 的完整实现，它实现了一个简单的 FrameLayout 以及在左右 gutter 中堆叠子项的能力。

source: Here is a high level overview of what you need to know to get started in creating your own View components:
zh_cn: 这里是有关如何开始创建自己的 View 组件的高度概括：

source: Here is a sample NinePatch file used to define a button:
zh_cn: 下面是使用 NinePatch 定义按钮的例子。

source: Here is a simple example:
zh_cn: 这是一个简单的例子：

source: Here is an example implementation of a pager containing fragments of lists:
zh_cn: 以下是包含一组 fragment 的 pager 的实现示例：

source: Here is the list of available constraints (Fig. 2):
zh_cn: 以下是可用约束的列表(图 2)：

source: Here's a snippet from PieChart.onSizeChanged() that shows how to do this:
zh_cn: 以下是来自 PieChart.onSizeChanged() 的片段，其中显示了如何执行此操作：

source: Here's a summary of some of the other standard methods that the framework calls on views:
zh_cn: 这里有一些框架在 view 中调用的标准的方法的摘要：

source: Here's an example implementation of onMeasure().
zh_cn: 这是 onMeasure() 的示例实现。

source: Here's an example of an attrs.xml file:
zh_cn: 以下是 attrs.xml 文件的示例：

source: Here's an example of the logcat output:
zh_cn: 这是 logcat 输出的一个例子：

source: Here's an example:
zh_cn: 这是一个例子：

source: Here's how the PieChart class reads its attributes:
zh_cn: 以下是 PieChart 类如何读取其属性：

source: Here's some sample layout XML that demonstrates how to add a NinePatch image to a couple of buttons.
zh_cn: 下面是一个 XML 布局示例，演示了如何给一对按钮添加 NinePatch 图。

source: Hide the ActionBar if it is currently showing.
zh_cn: 隐藏当前显示的操作栏。

source: Hide the overflow items from the associated menu.
zh_cn: 隐藏关联菜单中的溢出项目。

source: Hint indicating that this view can be autofilled with a credit card expiration date.
zh_cn: 提示表明此 view 可以使用信用卡到期日自动填充。

source: Hint indicating that this view can be autofilled with a credit card expiration day.
zh_cn: 提示表明此 view 可以使用信用卡到期日自动填充。

source: Hint indicating that this view can be autofilled with a credit card expiration month.
zh_cn: 提示表明此 view 可以使用信用卡到期月份自动填充。

source: Hint indicating that this view can be autofilled with a credit card expiration year.
zh_cn: 提示表明此 view 可以使用信用卡到期年份自动填充。

source: Hint indicating that this view can be autofilled with a credit card number.
zh_cn: 提示表明此 view 可以使用信用卡号自动填充。

source: Hint indicating that this view can be autofilled with a credit card security code.
zh_cn: 提示表明此 view 可以使用信用卡安全代码自动填充。

source: Hint indicating that this view can be autofilled with a password.
zh_cn: 提示表明可以使用密码自动填充此 view。

source: Hint indicating that this view can be autofilled with a phone number.
zh_cn: 提示表明此 view 可以使用电话号码自动填充。

source: Hint indicating that this view can be autofilled with a postal address.
zh_cn: 提示表明此 view 可以使用邮政地址自动填充。

source: Hint indicating that this view can be autofilled with a postal code.
zh_cn: 提示表明此 view 可以使用邮政编码自动填充。

source: Hint indicating that this view can be autofilled with a user's real name.
zh_cn: 提示表明可以使用用户的真实姓名自动填充此 view。

source: Hint indicating that this view can be autofilled with a username.
zh_cn: 提示表明可以使用用户名自动填充此 view。

source: Hint indicating that this view can be autofilled with an email address.
zh_cn: 提示表明此 view 可以使用电子邮件地址自动填充。

source: Hint to the path to prepare for adding more points.
zh_cn: 提示准备添加更多点的路径。

source: Hints the Android System whether the view node associated with this View should be included in a view structure used for autofill purposes.
zh_cn: 提示 Android 系统是否应将与此 view 关联的 view 节点包含在用于自动填充目的的 view 结构中。

source: Holder to be added to the pool.
zh_cn: 要添加到池中的 holder。

source: Hook allowing a behavior to re-apply a representation of its internal state that had previously been generated by onSaveInstanceState(CoordinatorLayout, V).
zh_cn: 钩子允许行为重新应用之前由 onSaveInstanceState(CoordinatorLayout, V) 生成的内部状态的表示。

source: Hook allowing a view to re-apply a representation of its internal state that had previously been generated by onSaveInstanceState().
zh_cn: Hook 允许一个 view 重新应用它内部状态的展现，该状态之前由 onSaveInstanceState() 生成。

source: Horizontal Guidelines have a height of zero and the width of their ConstraintLayout parent
zh_cn: 垂直的 Guidelines 高度为 0，宽度为其父 ConstraintLayout 的宽度。

source: Horizontal layout direction of this view is from Left to Right.
zh_cn: 此 view 的水平布局方向是从左到右。

source: Horizontal layout direction of this view is from Right to Left.
zh_cn: 此 view 的水平布局方向是从右到左。

source: Horizontal layout direction of this view is from deduced from the default language script for the locale.
zh_cn: 此 view 的水平布局方向来自语言环境的默认语言脚本。
